Router>enable
Router#configure
Configuring from terminal, memory, or network [terminal]? 
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface gigabitEthernet 0/0
Router(config-if)#ip address 172.16.31.1 255.255.0.0
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up

Router(config-if)#exit
Router(config)#hostname RTA
RTA(config)#service password-encryption
RTA(config)#enable secret shravan
RTA(config)#ip domain-name RTA.com
RTA(config)#username sss password 12345
RTA(config)#crypto key generate rsa
The name for the keys will be: RTA.RTA.com
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 1024
% Generating 1024 bit RSA keys, keys will be non-exportable...[OK]

RTA(config)#login block-for 180 attempts 4 within 120
*Mar 1 0:5:40.744: %SSH-5-ENABLED: SSH 1.99 has been enabled
RTA(config)#line vty 0 4
RTA(config-line)#transport input ssh
RTA(config-line)#login
% Login disabled on line 132, until 'password' is set
% Login disabled on line 133, until 'password' is set
% Login disabled on line 134, until 'password' is set
% Login disabled on line 135, until 'password' is set
% Login disabled on line 136, until 'password' is set
RTA(config-line)#login local
RTA(config-line)#^Z
RTA#
%SYS-5-CONFIG_I: Configured from console by console

RTA#copy running-config startup-config
Destination filename [startup-config]? 
Building configuration...
[OK]
RTA#